In [1]:
# https://api.mongodb.com/python/current/tutorial.html
import pprint
from pymongo import MongoClient
import pandas as pd
import requests as req 
import json
import math

client = MongoClient('mongodb://localhost:27017/')
db = client.ejercicio

In [2]:
# {$and:[{deadpooled_year:null}, {number_of_employees:{$ne:null}}, {"offices.latitude":{$ne:null}}, {"offices.latitude":{$exists:true}}]}

In [3]:
empresas= db.companhias.find({"$and":[{"deadpooled_year":None}, {"number_of_employees":{"$ne":None}}, {"offices.latitude":{"$ne":None}}, {"offices.latitude":{"$exists":"true"}}]})

In [4]:
df=pd.DataFrame(empresas)[["name","category_code","number_of_employees","founded_year", "total_money_raised","offices"]]

In [5]:
df.shape

(4839, 6)

In [6]:
df.head()

,name,category_code,number_of_employees,founded_year,total_money_raised,offices
0,Digg,news,60,2004.0,$45M,"[{'description': None, 'address1': '135 Missis..."
1,Geni,web,18,2006.0,$16.5M,"[{'description': 'Headquarters', 'address1': '..."
2,Fox Interactive Media,web,0,1979.0,$0,"[{'description': '', 'address1': '407 N Maple ..."
3,Scribd,news,50,2007.0,$25.8M,"[{'description': 'HQ', 'address1': '539 Bryant..."
4,MeetMoi,social,15,2007.0,$5.58M,"[{'description': None, 'address1': '', 'addres..."

In [7]:
#df.dtypes

In [8]:
res = req.get("https://api.exchangeratesapi.io/latest?base=USD").json()

In [9]:
res

{'rates': {'CAD': 1.3055728934,
  'HKD': 7.8004458315,
  'ISK': 126.348640214,
  'PHP': 51.3419527419,
  'DKK': 6.6545697726,
  'HUF': 289.4872938029,
  'CZK': 22.7454302274,
  'GBP': 0.7991529202,
  'RON': 4.2086491306,
  'SEK': 9.4492197949,
  'IDR': 14110.0044583148,
  'INR': 68.5648684797,
  'BRL': 3.8120374498,
  'RUB': 63.7561301828,
  'HRK': 6.5942933571,
  'JPY': 108.6045474811,
  'THB': 30.7748551048,
  'CHF': 0.992153366,
  'EUR': 0.8916629514,
  'MYR': 4.1405260811,
  'BGN': 1.7439144004,
  'TRY': 5.7337494427,
  'CNY': 6.8812304949,
  'NOK': 8.6348640214,
  'NZD': 1.5058403923,
  'ZAR': 14.1607668301,
  'USD': 1.0,
  'MXN': 18.9550601872,
  'SGD': 1.359518502,
  'AUD': 1.4318323674,
  'ILS': 3.5751226037,
  'KRW': 1178.8408381632,
  'PLN': 3.7922425323},
 'base': 'USD',
 'date': '2019-07-08'}

In [10]:
res["rates"]["EUR"]

0.8916629514

In [11]:
df1=df.copy()

In [17]:
df1["total_money_raised"]=df1["total_money_raised"].str.replace("M","000000")
df1["total_money_raised"]=df1["total_money_raised"].str.replace("k","000")
df1["total_money_raised"]=df1["total_money_raised"].str.replace("B","000000000")
df1["total_money_raised"]=df1["total_money_raised"].str.replace(".","")
df1["total_money_raised"]=df1["total_money_raised"].str.replace("$","")
df1["total_money_raised"]=df1["total_money_raised"].str.replace("r","")

In [18]:
def cambiar(string):
    if string.startswith("€"):
        string=string.replace("€","")
        string= int(string)*res["rates"]["EUR"]
    elif string.startswith("£"):
        string=string.replace("£","")
        string= int(string)*res["rates"]["GBP"]
    elif string.startswith("¥"):
        string=string.replace("¥","")
        string= int(string)*res["rates"]["JPY"]
    elif string.startswith("C"):
        string=string.replace("C","")
        string= int(string)*res["rates"]["CAD"]
    return string

In [19]:
df1["total_money_raised"]=df1["total_money_raised"].apply(cambiar)

AttributeError: 'float' object has no attribute 'startswith'

In [20]:
df1["total_money_raised"].value_counts()

0            3559
1000000        36
500000         24
10000000       22
3000000        19
100000         18
250000         17
600000         17
25000000       16
15000000       15
5000000        15
4000000        15
35000000       14
11000000       13
12000000       12
2000000        10
150000         10
125000000       9
13000000        9
175000000       9
350000          9
102000000       9
16000000        9
75000000        9
50000           9
45000000        9
7000000         8
131000000       8
31000000        8
20000000        7
             ...
190000000       1
291000000       1
695000000       1
670000          1
287000000       1
445000000       1
276000000       1
655000          1
355000          1
828000000       1
876000000       1
299000000       1
209000000       1
801000          1
136000000       1
247000000       1
216000000       1
340000          1
502000000       1
421000000       1
193000000       1
837000000       1
478000000       1
555000000       1
684000000       1
827000000       1
436000000       1
424000000       1
72000000        1
959000000       1
Name: total_money_raised, Length: 467, dtype: int64

In [22]:
df1.head()

,name,category_code,number_of_employees,founded_year,total_money_raised,offices
0,Digg,news,60,2004.0,45000000,"[{'description': None, 'address1': '135 Missis..."
1,Geni,web,18,2006.0,165000000,"[{'description': 'Headquarters', 'address1': '..."
2,Fox Interactive Media,web,0,1979.0,0,"[{'description': '', 'address1': '407 N Maple ..."
3,Scribd,news,50,2007.0,258000000,"[{'description': 'HQ', 'address1': '539 Bryant..."
4,MeetMoi,social,15,2007.0,558000000,"[{'description': None, 'address1': '', 'addres..."

In [23]:
def getFirst(data):
    data = data['offices']
#    return (len(data),data[0]['latitude'],data[0]['longitude'])

    # Only create the geoJSON object if all geodata is available
    principal = None
    if data[0]['latitude'] and data[0]['longitude']:
        principal = {
            "type":"Point",
            "coordinates":[data[0]['longitude'], data[0]['latitude']]
        }

    return {
        "totalOffices": len(data),
        "lat": data[0]['latitude'],
        "lng": data[0]['longitude'],
        "oficina_principal": principal
    }


first_office = df1[["offices"]].apply(getFirst, result_type="expand", axis=1)

In [25]:
first_office.head()

,lat,lng,oficina_principal,totalOffices
0,37.764726,-122.394523,"{'type': 'Point', 'coordinates': [-122.394523,...",1
1,34.090368,-118.393064,"{'type': 'Point', 'coordinates': [-118.393064,...",1
2,34.076179,-118.394170,"{'type': 'Point', 'coordinates': [-118.39417, ...",1
3,37.789634,-122.404052,"{'type': 'Point', 'coordinates': [-122.404052,...",1
4,40.757929,-73.985506,"{'type': 'Point', 'coordinates': [-73.985506, ...",1

In [26]:
df_clean = pd.concat([df1,first_office], axis=1)[["name","lng","lat", "oficina_principal","totalOffices", "category_code", "number_of_employees", "founded_year", "total_money_raised"]]

In [28]:
df_clean.head()

,name,lng,lat,oficina_principal,totalOffices,category_code,number_of_employees,founded_year,total_money_raised
0,Digg,-122.394523,37.764726,"{'type': 'Point', 'coordinates': [-122.394523,...",1,news,60,2004.0,45000000
1,Geni,-118.393064,34.090368,"{'type': 'Point', 'coordinates': [-118.393064,...",1,web,18,2006.0,165000000
2,Fox Interactive Media,-118.394170,34.076179,"{'type': 'Point', 'coordinates': [-118.39417, ...",1,web,0,1979.0,0
3,Scribd,-122.404052,37.789634,"{'type': 'Point', 'coordinates': [-122.404052,...",1,news,50,2007.0,258000000
4,MeetMoi,-73.985506,40.757929,"{'type': 'Point', 'coordinates': [-73.985506, ...",1,social,15,2007.0,558000000

In [31]:
df_clean["total_money_raised"]=df_clean["total_money_raised"].apply(pd.to_numeric)

In [34]:
df_clean.head()

,name,lng,lat,oficina_principal,totalOffices,category_code,number_of_employees,founded_year,total_money_raised
0,Digg,-122.394523,37.764726,"{'type': 'Point', 'coordinates': [-122.394523,...",1,news,60,2004.0,45000000.0
1,Geni,-118.393064,34.090368,"{'type': 'Point', 'coordinates': [-118.393064,...",1,web,18,2006.0,165000000.0
2,Fox Interactive Media,-118.394170,34.076179,"{'type': 'Point', 'coordinates': [-118.39417, ...",1,web,0,1979.0,0.0
3,Scribd,-122.404052,37.789634,"{'type': 'Point', 'coordinates': [-122.404052,...",1,news,50,2007.0,258000000.0
4,MeetMoi,-73.985506,40.757929,"{'type': 'Point', 'coordinates': [-73.985506, ...",1,social,15,2007.0,558000000.0

In [35]:
df_clean.to_json('limpio.json', orient="records")